# tapity tapity tap
tap 'caskroom/cask'
tap 'goles/battery'
tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'thoughtbot/formulae'
tap 'universal-ctags/universal-ctags'
# brew install
brew 'openssl'
brew 'readline'
brew 'sqlite'
brew 'python'
brew 'libxml2'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'git'
brew 'carthage'
brew 'chrome-cli'
brew 'chruby'
brew 'ctags'
brew 'diff-so-fancy'
brew 'jpeg'
brew 'libpng'
brew 'libtiff'
brew 'wxmac'
brew 'erlang'
brew 'elixir'
brew 'ffind'
brew 'fzf'
brew 'go'
brew 'graphviz'
brew 'heroku'
brew 'lua'
brew 'highlight'
brew 'hub'
brew 'perl'
brew 'imagemagick'
brew 'oniguruma'
brew 'jq'
brew 'libevent'
brew 'libffi'
brew 'libyaml'
brew 'mercurial'
brew 'node'
brew 'node@4'
brew 'pcre'
brew 'postgresql', restart_service: true
brew 'pgcli'
brew 'phantomjs'
brew 'pkg-config'
brew 'pngcrush'
brew 'qt5'
brew 'qt@5.5'
brew 'reattach-to-user-namespace'
brew 'redis', restart_service: true
brew 'ruby'
brew 'ruby-install'
brew 'shellcheck'
brew 'source-highlight'
brew 'spark'
brew 'the_silver_searcher'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'utf8proc'
brew 'vim'
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'youtube-dl'
brew 'zplug'
brew 'goles/battery/battery'
brew 'thoughtbot/formulae/gitsh'
brew 'thoughtbot/formulae/parity'
brew 'thoughtbot/formulae/rcm'
brew 'universal-ctags/universal-ctags/universal-ctags', args: ['HEAD']
# cask install
cask '1password'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'arq'
cask 'atom'
cask 'basecamp'
cask 'caffeine'
cask 'cleanmymac'
cask 'coda'
cask 'dash'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
# cask 'Firefoxdeveloperedition' <-- Not sure why it fails?
cask 'google-chrome'
cask 'google-drive-file-stream'
cask 'harvest'
cask 'haskell-platform'
cask 'iterm2'
cask 'kindle'
cask 'licecap'
cask 'marked'
cask 'microsoft-office'
cask 'navicat-for-mysql'
cask 'ngrok'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'querious'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'screenflow'
cask 'skitch'
cask 'sketch'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'suspicious-package'
cask 'transmission'
cask 'transmit'
cask 'vlc'
cask 'webpquicklook'
cask 'yakyak'
